app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @tab_color = true #background color for the table
    @messages = Message.all