app/controllers/users_controller.rb

  def create_user
    if registration?(params[:phone_number])
      if correct_registration_message?(params[:trash])
        if username_doesnt_exists?(params[:trash])
          User.create(:username => params[:trash].split[1], :phone_number => params[:phone_number], :gender => params[:trash].split[2], :age => params[:trash].split[3].to_i)
---
INSERT INTO "users" ("phone_number", "exclusion_list", "gender", "updated_at", "age", "created_at", "username", "trash", "area") VALUES (9999, NULL, 'h', '2011-10-14 18:37:29.801180', 23, '2011-10-14 18:37:29.801180', 'mephisto', NULL, NULL) RETURNING "id"

  def register_area
    if user_registered?(params[:phone_number])
      @user = User.find_by_phone_number(params[:phone_number])
      @area = params[:trash].sub('a? ', '').sub('A? ', '').sub('a?', '').sub('A?', '')
      @user.update_attributes(:area => @area)
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" IS NULL LIMIT 1
UPDATE "users" SET "updated_at" = '2011-10-13 21:59:29.647813', "area" = 'hhgyyt' WHERE "users"."id" = 26

  def search_user
    if user_registered?(params[:phone_number])
      @gender = find_gender(User.find_by_phone_number(params[:phone_number]))
      @var = params[:trash].split
      @age_min = @var[0].to_i
      @age_max = @var[1].to_i
      @tab_color = true #background color for the table
      if @var.size.eql?(2)
        @users = User.find(:all, :conditions => { :age => @age_min..@age_max, :gender => @gender })
      else
        @var.slice!(0)
        @var.slice!(0)
        @var = @var.join(' ')
        @users = User.find(:all, :conditions => { :age => @age_min..@age_max, :gender => @gender, :area => @var})
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = 5555 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."gender" = 'f' AND ("users"."age" BETWEEN 21 AND 23)
SELECT "users".* FROM "users" WHERE "users"."area" IN ('cocody') AND "users"."gender" = 'f' AND ("users"."age" BETWEEN 0 AND 0)

  def send_message
    @receiver = User.find_by_username(params[:trash].split[0].sub('?', '')).phone_number
    @sender = User.find_by_phone_number(params[:phone_number]).id
    Message.create(:receiver => @receiver, :user_id => @sender, :content => params[:trash].sub(params[:trash].split[0], ''))
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = 4444 LIMIT 1
INSERT INTO "messages" ("user_id", "receiver", "new_message", "updated_at", "created_at", "content") VALUES (29, 6666, NULL, '2011-10-14 18:39:32.355509', '2011-10-14 18:39:32.355509', ' finally done bro') RETURNING "id"

  def list_users
    @users = User.all
---
SELECT "users".* FROM "users"